[Killed] BlockStatement
src/foerdersumme.js:5:60
 const MAXIMALE_FOERDERSUMME = 30000;
 const MINDESTFOERDERSUMME = 6000;
 
-function beantragteFoerdersumme(gesamtausgaben, einnahmen) {
-    if (gesamtausgaben < 0 || einnahmen < 0) {
-        throw new Error("Ausgaben und Einnahmen dürfen nicht negativ sein.");
-    }
-
-    const finanzierungsbedarf = gesamtausgaben - einnahmen;
-    if (finanzierungsbedarf <= 0) {
-        return 0;
-    }
-
-    const foerdersumme = Math.min(
-        gesamtausgaben * MAXIMALER_FOERDERANTEIL,
-        MAXIMALE_FOERDERSUMME,
-        finanzierungsbedarf
-    );
-
-    if (foerdersumme < MINDESTFOERDERSUMME) {
-        return 0;
-    }
-
-    return foerdersumme;
-}
+function beantragteFoerdersumme(gesamtausgaben, einnahmen) {}
 module.exports = {
     beantragteFoerdersumme
killedBy: beantragteFoerdersumme maximale Fördersumme beträgt 30.000 Euro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30000
Received: undefined

[Killed] EqualityOperator
src/foerdersumme.js:6:9
 const MINDESTFOERDERSUMME = 6000;
 
 function beantragteFoerdersumme(gesamtausgaben, einnahmen) {
-    if (gesamtausgaben < 0 || einnahmen < 0) {
+    if (gesamtausgaben >= 0 || einnahmen < 0) {
         throw new Error("Ausgaben und Einnahmen dürfen nicht negativ sein.");
     }
killedBy: beantragteFoerdersumme maximale Fördersumme beträgt 30.000 Euro
statusReason: Error: Ausgaben und Einnahmen dürfen nicht negativ sein.

[Killed] EqualityOperator
src/foerdersumme.js:6:31
 const MINDESTFOERDERSUMME = 6000;
 
 function beantragteFoerdersumme(gesamtausgaben, einnahmen) {
-    if (gesamtausgaben < 0 || einnahmen < 0) {
+    if (gesamtausgaben < 0 || einnahmen <= 0) {
         throw new Error("Ausgaben und Einnahmen dürfen nicht negativ sein.");
     }
killedBy: beantragteFoerdersumme maximale Fördersumme beträgt 30.000 Euro
statusReason: Error: Ausgaben und Einnahmen dürfen nicht negativ sein.

[Killed] ArithmeticOperator
src/foerdersumme.js:10:33
         throw new Error("Ausgaben und Einnahmen dürfen nicht negativ sein.");
     }
 
-    const finanzierungsbedarf = gesamtausgaben - einnahmen;
+    const finanzierungsbedarf = gesamtausgaben + einnahmen;
     if (finanzierungsbedarf <= 0) {
         return 0;
killedBy: beantragteFoerdersumme Einnahmen reduzieren den Finanzierungsbedarf
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10000
Received: 12000

[Killed] EqualityOperator
src/foerdersumme.js:11:9
     }
 
     const finanzierungsbedarf = gesamtausgaben - einnahmen;
-    if (finanzierungsbedarf <= 0) {
+    if (finanzierungsbedarf > 0) {
         return 0;
     }
killedBy: beantragteFoerdersumme maximale Fördersumme beträgt 30.000 Euro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30000
Received: 0

[Killed] ConditionalExpression
src/foerdersumme.js:11:9
     }
 
     const finanzierungsbedarf = gesamtausgaben - einnahmen;
-    if (finanzierungsbedarf <= 0) {
+    if (true) {
         return 0;
     }
killedBy: beantragteFoerdersumme maximale Fördersumme beträgt 30.000 Euro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30000
Received: 0

[Killed] MethodExpression
src/foerdersumme.js:15:26
         return 0;
     }
 
-    const foerdersumme = Math.min(
-        gesamtausgaben * MAXIMALER_FOERDERANTEIL,
-        MAXIMALE_FOERDERSUMME,
-        finanzierungsbedarf
-    );
+    const foerdersumme = Math.max(gesamtausgaben * MAXIMALER_FOERDERANTEIL, MAXIMALE_FOERDERSUMME, finanzierungsbedarf);
 
     if (foerdersumme < MINDESTFOERDERSUMME) {
killedBy: beantragteFoerdersumme maximale Fördersumme beträgt 30.000 Euro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30000
Received: 100000

[Killed] ArithmeticOperator
src/foerdersumme.js:16:9
     }
 
     const foerdersumme = Math.min(
-        gesamtausgaben * MAXIMALER_FOERDERANTEIL,
+        gesamtausgaben / MAXIMALER_FOERDERANTEIL,
         MAXIMALE_FOERDERSUMME,
         finanzierungsbedarf
killedBy: beantragteFoerdersumme maximal 60 Prozent der Gesamtausgaben werden gefördert
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12000
Received: 20000

[Killed] BlockStatement
src/foerdersumme.js:21:45
         finanzierungsbedarf
     );
 
-    if (foerdersumme < MINDESTFOERDERSUMME) {
-        return 0;
-    }
+    if (foerdersumme < MINDESTFOERDERSUMME) {}
 
     return foerdersumme;
killedBy: beantragteFoerdersumme keine Förderung, wenn mögliche Förderung unter 6.000 Euro liegt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5400

[Killed] EqualityOperator
src/foerdersumme.js:21:9
         finanzierungsbedarf
     );
 
-    if (foerdersumme < MINDESTFOERDERSUMME) {
+    if (foerdersumme <= MINDESTFOERDERSUMME) {
         return 0;
     }
killedBy: beantragteFoerdersumme Förderung möglich, wenn Mindestfördersumme genau 6.000 Euro beträgt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: 0

[Killed] ObjectLiteral
src/foerdersumme.js:27:18
 
     return foerdersumme;
 }
-module.exports = {
-    beantragteFoerdersumme
-};
+module.exports = {};
killedBy: beantragteFoerdersumme maximale Fördersumme beträgt 30.000 Euro
statusReason: TypeError: beantragteFoerdersumme is not a function
