[Killed] BlockStatement
src/shoppingCart.js:6:26
         this.items = [];
     }
 
-    addItem(name, price) {
-        this.items.push({ name, price });
-    }
+    addItem(name, price) {}
 
     getTotal() {
killedBy: Ein Item zum Warenkorb hinzufügen, Warenkorbwert erhöht sich
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ObjectLiteral
src/shoppingCart.js:7:25
     }
 
     addItem(name, price) {
-        this.items.push({ name, price });
+        this.items.push({});
     }
 
killedBy: Ein Item zum Warenkorb hinzufügen, Warenkorbwert erhöht sich
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: NaN

[Killed] BlockStatement
src/shoppingCart.js:10:16
         this.items.push({ name, price });
     }
 
-    getTotal() {
-        return this.items.reduce((sum, item) => sum + item.price, 0);
-    }
+    getTotal() {}
 
     getTotalItemCount() {
killedBy: Warenkorb hat Wert von 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ArrowFunction
src/shoppingCart.js:11:34
     }
 
     getTotal() {
-        return this.items.reduce((sum, item) => sum + item.price, 0);
+        return this.items.reduce(() => undefined, 0);
     }
 
killedBy: Ein Item zum Warenkorb hinzufügen, Warenkorbwert erhöht sich
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
src/shoppingCart.js:11:49
     }
 
     getTotal() {
-        return this.items.reduce((sum, item) => sum + item.price, 0);
+        return this.items.reduce((sum, item) => sum - item.price, 0);
     }
 
killedBy: Ein Item zum Warenkorb hinzufügen, Warenkorbwert erhöht sich
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -5

[Killed] BlockStatement
src/shoppingCart.js:14:25
         return this.items.reduce((sum, item) => sum + item.price, 0);
     }
 
-    getTotalItemCount() {
-        return this.items.length;
-    }
+    getTotalItemCount() {}
 
     getItems() {
killedBy: Anzahl an Items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BlockStatement
src/shoppingCart.js:18:16
         return this.items.length;
     }
 
-    getItems() {
-        return this.items;
-    }
+    getItems() {}
 
     getSpecificItemCount(itemName) {
killedBy: Name eines Items
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"name": "Apfel", "price": 5}]
Received: undefined

[Killed] BlockStatement
src/shoppingCart.js:22:36
         return this.items;
     }
 
-    getSpecificItemCount(itemName) {
-        let count = 0;
-
-        for (const item of this.items) {
-            if (item.name === itemName) {
-                count++;
-            }
-        }
-
-        console.log(`${itemName}: ${count}`);
-
-        return count;
-    }
+    getSpecificItemCount(itemName) {}
 }
 module.exports = {
killedBy: Anzahl eines bestimmten Items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BlockStatement
src/shoppingCart.js:25:40
     getSpecificItemCount(itemName) {
         let count = 0;
 
-        for (const item of this.items) {
-            if (item.name === itemName) {
-                count++;
-            }
-        }
+        for (const item of this.items) {}
 
         console.log(`${itemName}: ${count}`);
killedBy: Anzahl eines bestimmten Items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/shoppingCart.js:26:41
         let count = 0;
 
         for (const item of this.items) {
-            if (item.name === itemName) {
-                count++;
-            }
+            if (item.name === itemName) {}
         }
 
killedBy: Anzahl eines bestimmten Items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ConditionalExpression
src/shoppingCart.js:26:17
         let count = 0;
 
         for (const item of this.items) {
-            if (item.name === itemName) {
+            if (false) {
                 count++;
             }
killedBy: Anzahl eines bestimmten Items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] UpdateOperator
src/shoppingCart.js:27:17
 
         for (const item of this.items) {
             if (item.name === itemName) {
-                count++;
+                count--;
             }
         }
killedBy: Anzahl eines bestimmten Items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -3
